Revit 2024 API
UIMacroManager.EditModule Method
 Edits the macro in sharp develop.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void EditModule(
	MacroModule module
)
Visual Basic
Public Sub EditModule ( _
	module As MacroModule _
)
Visual C++
public:
void EditModule(
	MacroModule^ module
)
Parameters
module
Type: Autodesk.Revit.DB.Macros.MacroModule
 The macro module.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace